tap "anomalyco/tap"
tap "aviator-co/tap"
tap "blendle/blendle"
tap "chainguard-dev/tap"
tap "coderabbitai/tap"
tap "dopplerhq/doppler", "https://github.com/DopplerHQ/homebrew-doppler.git"
tap "drolosoft/tap"
tap "dsully/tap"
tap "hashicorp/tap"
tap "manaflow-ai/cmux"
tap "oven-sh/bun"
tap "sourcegraph/src-cli"
# Run your GitHub Actions locally
brew "act"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Programmable completion for Bash 3.2
brew "bash-completion"
# New way of working with Protocol Buffers
brew "buf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# See where your AI coding tokens go - by task, tool, model, and project
brew "codeburn"
# Kubernetes command-line interface
brew "kubernetes-cli"
# CLI helps develop/deploy/debug apps with Docker and k8s
brew "devspace"
# CLI for interacting with Doppler secrets and configuration
brew "doppler"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Kubernetes package manager
brew "helm"
# Bash and zsh history suggest box
brew "hstr"
# HTML validator written in Go
brew "htmltest"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Package manager for kubectl plugins
brew "krew"
# Colorize your kubectl output
brew "kubecolor"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Terminal file manager
brew "lf"
# TIFF library and utilities
brew "libtiff"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# QR Code generation
brew "qrencode"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Yet Another Dotfiles Manager
brew "yadm"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Utility that prevents the system from going to sleep
cask "caffeine"
# Menu bar timezone tracker and compact calendar
cask "clocker"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-monaspace-nf"
# Menu bar calendar
cask "itsycal"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# System monitor for the menu bar
cask "stats"
# Menu bar manager
cask "thaw"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "github.com/goreleaser/goreleaser/v2"
go "github.com/raviqqe/muffet/v2"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/tomarrell/wrapcheck/v2/cmd/wrapcheck"
uv "playwright"
krew "ctx"
krew "ns"
npm "context-mode"
npm "task-master-ai"
