tap "anomalyco/tap"
tap "aviator-co/tap"
tap "blendle/blendle"
tap "chainguard-dev/tap"
tap "coderabbitai/tap"
tap "dopplerhq/cli"
tap "drolosoft/tap"
tap "dsully/tap"
tap "hashicorp/tap"
tap "manaflow-ai/cmux"
tap "oven-sh/bun"
tap "sourcegraph/src-cli"
tap "wandb/taps"
brew "act"
brew "argocd"
brew "asdf"
brew "bash-completion"
brew "buf"
brew "kubernetes-cli"
brew "devspace"
brew "doppler"
brew "openssl@3"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "helm"
brew "hstr"
brew "htop"
brew "hugo"
brew "jira-cli"
brew "jq"
brew "k9s"
brew "kind"
brew "krew"
brew "kubecolor"
brew "kubeconform"
brew "lf"
brew "mise"
brew "navi"
brew "neovim"
brew "python@3.14"
brew "nmap"
brew "node"
brew "openjdk"
brew "poppler"
brew "qrencode"
brew "starship"
brew "tilt"
brew "tree"
brew "uv"
brew "watch"
brew "yadm"
brew "yq"
brew "zinit"
brew "zoxide"
brew "zsh-completions"
brew "anomalyco/tap/opencode"
brew "aviator-co/tap/av"
brew "blendle/blendle/kns"
brew "chainguard-dev/tap/chainctl"
brew "coderabbitai/tap/git-gtr"
brew "drolosoft/tap/cmux-resurrect"
brew "dsully/tap/macos-defaults"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
brew "sourcegraph/src-cli/src-cli"
brew "wandb/taps/hivemind"
cask "caffeine"
cask "clocker"
cask "codex"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-monaspace-nf"
cask "itsycal"
cask "stats"
cask "thaw"
vscode "1abhishekpandey.live-markdown"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "coder.coder-remote"
vscode "codesmith.markdown-inline-editor-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "jackiotyu.git-worktree-manager"
vscode "kevinrose.vsc-python-indent"
vscode "kylinideteam.gitlens"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-server"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "sourcegraph.sourcegraph"
vscode "sst-dev.opencode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "github.com/goreleaser/goreleaser/v2"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/tomarrell/wrapcheck/v2/cmd/wrapcheck"
krew "ctx"
krew "ns"
